Messwerte/Archiv/Raw/apache_benchmark_repeat35/default/default/httpd/target_count_21/repeat_31/11.txt
2020/02/06 03:45:57 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8011/
2020/02/06 03:46:27 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 30087 requests
Server Software:        Apache/2.4.41
Server Hostname:        192.168.3.100
Server Port:            8011
Document Path:          /
Document Length:        45 bytes
Concurrency Level:      100
Time taken for tests:   30.000 seconds
Complete requests:      30087
Failed requests:        0
Total transferred:      8696010 bytes
HTML transferred:       1354050 bytes
Requests per second:    1002.89 [#/sec] (mean)
Time per request:       99.711 [ms] (mean)
Time per request:       0.997 [ms] (mean, across all concurrent requests)
Transfer rate:          283.07 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1   81 273.1     12    4083
Processing:     1   16  87.5      7    2431
Waiting:        0   16  87.5      7    2431
Total:          2   97 294.2     19    4089
Percentage of the requests served within a certain time (ms)
  50%     19
  66%     20
  75%     21
  80%     22
  90%     30
  95%   1027
  98%   1043
  99%   1050
 100%   4089 (longest request)
{"connect":{"max":4083,"mean":81,"median":12,"min":1,"stdDev":273.1000061035156},"percentiles":{"100":4089,"50":19,"66":20,"75":21,"80":22,"90":30,"95":1027,"98":1043,"99":1050},"processing":{"max":2431,"mean":16,"median":7,"min":1,"stdDev":87.5},"total":{"max":4089,"mean":97,"median":19,"min":2,"stdDev":294.20001220703125},"waiting":{"max":2431,"mean":16,"median":7,"min":0,"stdDev":87.5}}
2020/02/06 03:46:27 Matched stat line [Connect:        1   81 273.1     12    4083 Connect 1 81 273.1 12 4083]
2020/02/06 03:46:27 Matched stat line [Processing:     1   16  87.5      7    2431 Processing 1 16 87.5 7 2431]
2020/02/06 03:46:27 Matched stat line [Waiting:        0   16  87.5      7    2431 Waiting 0 16 87.5 7 2431]
2020/02/06 03:46:27 Matched stat line [Total:          2   97 294.2     19    4089 Total 2 97 294.2 19 4089]
2020/02/06 03:46:27 Matched percentline [  50%     19 50 19]
2020/02/06 03:46:27 Matched percentline [  66%     20 66 20]
2020/02/06 03:46:27 Matched percentline [  75%     21 75 21]
2020/02/06 03:46:27 Matched percentline [  80%     22 80 22]
2020/02/06 03:46:27 Matched percentline [  90%     30 90 30]
2020/02/06 03:46:27 Matched percentline [  95%   1027 95 1027]
2020/02/06 03:46:27 Matched percentline [  98%   1043 98 1043]
2020/02/06 03:46:27 Matched percentline [  99%   1050 99 1050]
2020/02/06 03:46:27 Matched percentline [ 100%   4089 100 4089]